In [3]:
import pandas as pd

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

![CSV](https://cdn-icons-png.flaticon.com/128/4911/4911248.png)
# *CSV*

>### <b>Default File Loading</b>

In [8]:
df = pd.read_csv('data/btc-faulty.csv')

df.head(3)

   2/4/17 0:00  1099.169125
0  3/4/17 0:00     1141.813
1  4/4/17 0:00            ?
2  5/4/17 0:00  1133.079314

>### **Fixing the header of file**

In [11]:
df = pd.read_csv('data/btc-faulty.csv',
                  header=None)

df.head()

             0            1
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00     1141.813
2  4/4/17 0:00            ?
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00            -

>### **Fixing Missing Values**

In [12]:
df = pd.read_csv('data/btc-faulty.csv',
                  header=None,
                  na_values=['', '?', '-'])

df.head()

             0            1
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

>### **Assigning Column Names with header parameter**

In [13]:
df = pd.read_csv('data/btc-faulty.csv',
                  header=None,
                  na_values=['', '?', '-'],
                  names=['Timestamp', 'Price'])

df.head(3)

     Timestamp        Price
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN

>### **Assigning type to a specific column**

In [15]:
df = pd.read_csv('data/btc-faulty.csv',
                  header=None,
                  na_values=['', '?', '-'],
                  names=['Timestamp', 'Price'],
                  dtype={'Price': 'float'})

df.dtypes

Timestamp     object
Price        float64
dtype: object

>### **Parsing Date to a column**

In [16]:
df = pd.read_csv('data/btc-faulty.csv',
                  header=None,
                  na_values=['', '?', '-'],
                  names=['Timestamp', 'Price'],
                  dtype={'Price': 'float'},
                  parse_dates=[0])

df.head(3)

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN

>### **Making a column as index**

Use it if you have a column with all unique values, it will work as better index.

In [17]:
df = pd.read_csv('data/btc-faulty.csv',
                  header=None,
                  na_values=['', '?', '-'],
                  names=['Timestamp', 'Price'],
                  dtype={'Price': 'float'},
                  parse_dates=[0],
                  index_col=[0])

df.head(3)

                  Price
Timestamp
2017-02-04  1099.169125
2017-03-04  1141.813000
2017-04-04          NaN

### Working with a Challenging CSV

This csv is supposed to have these column names:

first_name, last_name, age, math_score, french_score, next_test_date

In [18]:
exam_df = pd.read_csv('data/exam_review.csv')

exam_df

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

Here values are separated by '>' not by a comma. So we need to use **`sep`** parameter. It's a delimeter here.

In [19]:
exam_df = pd.read_csv('data/exam_review.csv',
                       sep = '>')

exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

>### Custom numeric `decimal` and `thousands` character

We can see math and french score has some score in thousands.

In [20]:
exam_df[['math_score', 'french_score']].dtypes

math_score      object
french_score    object
dtype: object

In [21]:
exam_df = pd.read_csv('data/exam_review.csv',
                       sep = '>',
                       decimal=',')

exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

***In case you wanna keep thousands values but wanna remove those commas.***

In [22]:
exam_df = pd.read_csv('data/exam_review.csv',
                       sep = '>',
                       thousands=',')

exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

> ### Excluding specific rows

In [23]:
exam_df = pd.read_csv('data/exam_review.csv',
                       sep = '>',
                       decimal=',',
                       skiprows=2)

exam_df    # Ray & Melvin are skipped

   Melvin   Scott  24    77  83
0  Amirah   Haley  22  92.0  67
1  Gerard   Mills  19  78.0  72
2     Amy  Grimes  23  91.0  81

In [24]:
exam_df = pd.read_csv('data/exam_review.csv',
                       sep = '>',
                       decimal=',',
                       skiprows=[1,3])

exam_df     # Original 1 and 3 got skipped. Ray & Amirah.

  first_name last_name  age  math_score  french_score
0     Melvin     Scott   24        77.0            83
1     Gerard     Mills   19        78.0            72
2        Amy    Grimes   23        91.0            81

> ### Get Rid of Blank Lines

By default it's true and all blank lines get skipped. If you wanna keep them then use FALSE but they will be given NaN value.

In [25]:
exam_df = pd.read_csv('data/exam_review.csv',
                       sep = '>',
                       decimal=',',
                       skiprows=[1,3],
                       skip_blank_lines=False)

> ### Loading Specific Columns only

It's useful when you wanna get better performance. Instead of later dropping columns, be selective with your columns while loading.

In [27]:
exam_df = pd.read_csv('data/exam_review.csv',
                       sep = '>',
                       usecols=['first_name', 'last_name', 'age'])

exam_df.head(2)

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24

In [28]:
exam_df = pd.read_csv('data/exam_review.csv',
                       sep = '>',
                       usecols=[0,1,2])

exam_df.head(2)

  first_name last_name  age
0        Ray    Morley   18
1     Melvin     Scott   24

>### Saving CSV

In [ ]:
exam_df.to_csv('final.csv')

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

#

![SQL](https://cdn-icons-png.flaticon.com/128/8175/8175769.png)


# *Database*

In [29]:
import sqlite3

In [33]:
# Without Pandas

conn = sqlite3.connect('data/chinook.db')

cursor = conn.cursor()

cursor.execute('SELECT * FROM employees LIMIT 5;')

result = cursor.fetchall()

result

[(1,
  'Adams',
  'Andrew',
  'General Manager',
  None,
  '1962-02-18 00:00:00',
  '2002-08-14 00:00:00',
  '11120 Jasper Ave NW',
  'Edmonton',
  'AB',
  'Canada',
  'T5K 2N1',
  '+1 (780) 428-9482',
  '+1 (780) 428-3457',
  'andrew@chinookcorp.com'),
 (2,
  'Edwards',
  'Nancy',
  'Sales Manager',
  1,
  '1958-12-08 00:00:00',
  '2002-05-01 00:00:00',
  '825 8 Ave SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 2T3',
  '+1 (403) 262-3443',
  '+1 (403) 262-3322',
  'nancy@chinookcorp.com'),
 (3,
  'Peacock',
  'Jane',
  'Sales Support Agent',
  2,
  '1973-08-29 00:00:00',
  '2002-04-01 00:00:00',
  '1111 6 Ave SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 5M5',
  '+1 (403) 262-3443',
  '+1 (403) 262-6712',
  'jane@chinookcorp.com'),
 (4,
  'Park',
  'Margaret',
  'Sales Support Agent',
  2,
  '1947-09-19 00:00:00',
  '2003-05-03 00:00:00',
  '683 10 Street SW',
  'Calgary',
  'AB',
  'Canada',
  'T2P 5G3',
  '+1 (403) 263-4423',
  '+1 (403) 263-4289',
  'margaret@chinookcorp.com'),
 (5,
  'Johnson',
  'Steve',
  'Sales Support Agent',
  2,
  '1965-03-03 00:00:00',
  '2003-10-17 00:00:00',
  '7727B 41 Ave',
  'Calgary',
  'AB',
  'Canada',
  'T3B 1Y7',
  '1 (780) 836-9987',
  '1 (780) 836-9543',
  'steve@chinookcorp.com')]

In [34]:
cursor.close()
conn.close()

#####

> ### Using Pandas `read_sql` method

- It doesn't require us to create a `Cursor` object or call `fetchall` at the end.
- No need to close the cursor or connection at the end.

In [35]:
conn = sqlite3.connect('data/chinook.db')

In [36]:
df = pd.read_sql('SELECT * FROM employees;', conn)

In [37]:
df.head(2)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com

***Customizing our DF***

In [38]:
df = pd.read_sql('SELECT * FROM employees;', conn,
                  index_col='EmployeeId',
                  parse_dates=['BirthDate', 'HireDate'])             

df.head(2)

,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
EmployeeId,,,,,,,,,,,,,,
1,Adams,Andrew,General Manager,NaN,1962-02-18,2002-08-14,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
2,Edwards,Nancy,Sales Manager,1.0,1958-12-08,2002-05-01,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com

In [44]:
df[df['ReportsTo'].isna()]    # Finding the one who doesn't reports to anyone.

,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
EmployeeId,,,,,,,,,,,,,,
1,Adams,Andrew,General Manager,NaN,1962-02-18,2002-08-14,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com

#####

> ### Using Pandas `read_sql_query` method

- `read_sql` is like a wrapper around `read_sql_query` & `read_sql_table`.

In [45]:
conn = sqlite3.connect('data/chinook.db')

In [47]:
df = pd.read_sql_query('SELECT * FROM employees LIMIT 5;', conn)

df.head(1)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com

***Gives same result like `read_sql`***

#####

> ### Using Pandas `read_sql_table` method

- Works only with SQLAlchemy.

- Better to use read_sql

> ### Saving database file via pandas

In [ ]:
df.to_sql('employee2', conn)

![green-divider](https://user-images.githubusercontent.com/7065401/52071924-c003ad80-2562-11e9-8297-1c6595f8a7ff.png)

#####

![HTML](https://icon-library.com/images/html5-icon/html5-icon-3.jpg)

# ***HTML***

In [49]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\himz\anaconda3\lib\site-packages (4.8.0)

> ### Read using `read_html`

- This method will read HTML tables from a given URL, a file-like object, or a raw string containing HTML, and return a list of DataFrame objects.

In [50]:
html_string = """
<table>
    <thead>
      <tr>
        <th>Order date</th>
        <th>Region</th> 
        <th>Item</th>
        <th>Units</th>
        <th>Unit cost</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>1/6/2018</td>
        <td>East</td> 
        <td>Pencil</td>
        <td>95</td>
        <td>1.99</td>
      </tr>
      <tr>
        <td>1/23/2018</td>
        <td>Central</td> 
        <td>Binder</td>
        <td>50</td>
        <td>19.99</td>
      </tr>
      <tr>
        <td>2/9/2018</td>
        <td>Central</td> 
        <td>Pencil</td>
        <td>36</td>
        <td>4.99</td>
      </tr>
      <tr>
        <td>3/15/2018</td>
        <td>West</td> 
        <td>Pen</td>
        <td>27</td>
        <td>19.99</td>
      </tr>
    </tbody>
</table>
"""

In [52]:
dfs = pd.read_html(html_string) 

dfs     # It's currently a list

[  Order date   Region    Item  Units  Unit cost
 0   1/6/2018     East  Pencil     95       1.99
 1  1/23/2018  Central  Binder     50      19.99
 2   2/9/2018  Central  Pencil     36       4.99
 3  3/15/2018     West     Pen     27      19.99]

In [53]:
df = dfs[0]

df

  Order date   Region    Item  Units  Unit cost
0   1/6/2018     East  Pencil     95       1.99
1  1/23/2018  Central  Binder     50      19.99
2   2/9/2018  Central  Pencil     36       4.99
3  3/15/2018     West     Pen     27      19.99

#####

> ### Defining Header

- Most of the times pandas automatically picks the header as html has tags.

In [ ]:
pd.read_html(html_string, header=0)[0]

#####

> ### Parsing HTML tables from the web

In [59]:
url = """https://www.basketball-reference.com/leagues/NBA_2022_per_game.html"""

In [62]:
nbas = pd.read_html(url)

In [64]:
nba = nbas[0]

nba.head(2)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Precious Achiuwa,C,22,TOR,73,28,23.6,3.6,8.3,...,.595,2.0,4.5,6.5,1.1,0.5,0.6,1.2,2.1,9.1
1,2,Steven Adams,C,28,MEM,76,75,26.3,2.8,5.1,...,.543,4.6,5.4,10.0,3.4,0.9,0.8,1.5,2.0,6.9

#####

> ### Complex Examples

-  If you wish to get a table from a complex website with many tables like a wikipedia then we need to use `requests`

In [65]:
import requests

url = """https://en.wikipedia.org/wiki/The_Simpsons"""

In [73]:
r = requests.get(url)

wikipedia = pd.read_html(r.text, header=0)

In [74]:
len(wikipedia)

47

In [75]:
simpsons = wikipedia[1]

simpsons.head()

,Season,Season.1,No. ofepisodes,Originally aired,Originally aired.1,Originally aired.2,Viewership,Viewership.1,Viewership.2
0,Season,Season,No. ofepisodes,Season premiere,Season finale,Time slot (ET),Avg. viewers(in millions),Most watched episode,Most watched episode
1,Season,Season,No. ofepisodes,Season premiere,Season finale,Time slot (ET),Avg. viewers(in millions),Viewers(millions),Episode title
2,1,198990,13,"December 17, 1989","May 13, 1990",Sunday 8:30pm,27.8,33.5,"""Life on the Fast Lane"""
3,2,199091,22,"October 11, 1990","July 11, 1991",Thursday 8:00pm,24.4,33.6,"""Bart Gets an 'F'"""
4,3,199192,24,"September 19, 1991","August 27, 1992",Thursday 8:00pm,21.8,25.5,"""Colonel Homer"""

- *Reason we are getting these 2 extra columns is because they are written in this way in wikipedia*

In [76]:
simpsons.drop([0,1], inplace=True)

In [77]:
simpsons.head(2)

,Season,Season.1,No. ofepisodes,Originally aired,Originally aired.1,Originally aired.2,Viewership,Viewership.1,Viewership.2
2,1,198990,13,"December 17, 1989","May 13, 1990",Sunday 8:30pm,27.8,33.5,"""Life on the Fast Lane"""
3,2,199091,22,"October 11, 1990","July 11, 1991",Thursday 8:00pm,24.4,33.6,"""Bart Gets an 'F'"""

In [78]:
simpsons.set_index('Season', inplace=True)

In [79]:
simpsons.head()

,Season.1,No. ofepisodes,Originally aired,Originally aired.1,Originally aired.2,Viewership,Viewership.1,Viewership.2
Season,,,,,,,,
1,198990,13,"December 17, 1989","May 13, 1990",Sunday 8:30pm,27.8,33.5,"""Life on the Fast Lane"""
2,199091,22,"October 11, 1990","July 11, 1991",Thursday 8:00pm,24.4,33.6,"""Bart Gets an 'F'"""
3,199192,24,"September 19, 1991","August 27, 1992",Thursday 8:00pm,21.8,25.5,"""Colonel Homer"""
4,199293,22,"September 24, 1992","May 13, 1993",Thursday 8:00pm,22.4,28.6,"""Lisa's First Word"""
5,199394,22,"September 30, 1993","May 19, 1994",Thursday 8:00pm,18.9,24.0,"""Treehouse of Horror IV"""

***Looking Better Now!***

***HTML pages are optimized for humans so they require cleaning to be readable nicely for machines***

***Lastly save this file as CSV***

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

#####

![EXCEL](https://cdn.iconscout.com/icon/free/png-128/microsoft-excel-3628922-3030062.png)

# EXCEL

This method supports both XLS and XLSX file extensions from a local filesystem or URL and has a broad set of parameters to configure how the data will be read and parsed. These parameters are very similar to the parameters of read_csv method. The most common parameters are as follows:

- `filepath`: Path of the file to be read.
- `sheet_name`: Strings are used for sheet names. Integers are used in zero-indexed sheet positions. Lists of strings/integers are used to request multiple sheets. Specify None to get all sheets.
- `header`: Index of the row containing the names of the columns (None if none).
- `index_col`: Index of the column or sequence of indexes that should be used as index of rows of the data.
- `names`: Sequence containing the names of the columns (used together with header = None).
- `skiprows`: Number of rows or sequence of row indexes to ignore in the load.
- `na_values`: Sequence of values that, if found in the file, should be treated as NaN.
- `dtype`: Dictionary in which the keys will be column names and the values will be types of NumPy to which their content must be converted.
- `parse_dates`: Flag that indicates if Python should try to parse data with a format similar to dates as dates. You can enter a list of column names that must be joined for the parsing as a date.
- `date_parser`: Function to use to try to parse dates.
- `nrows`: Number of rows to read from the beginning of the file.
- `skip_footer`: Number of rows to ignore at the end of the file.
- `squeeze`: Flag that indicates that if the data read only contains one column the result is a Series instead of a DataFrame.
- `thousands`: Character to use to detect the thousands separator.

> ### Read using `read_excel`

In [81]:
df = pd.read_excel('data/products.xlsx')          # It reads first sheet by default

df.head(2)

,product_id,price,merchant_id,brand,name
0,AVphzgbJLJeJML43fA0o,104.99,1001,Sanus,Sanus VLF410B1 10-Inch Super Slim Full-Motion ...
1,AVpgMuGwLJeJML43KY_c,69.00,1002,Boytone,Boytone - 2500W 2.1-Ch. Home Theater System - ...

> ### Selecting Specific Sheet

In [83]:
df = pd.read_excel('data/products.xlsx',
                    sheet_name='Merchants',
                    index_col='merchant_id')

df.head(3)

                merchant
merchant_id
1001         Bestbuy.com
1002         Walmart.com
1003         Bestbuy.com

> ## The `ExcelFile` class

Another approach on reading Excel data is using the ExcelFile class for parsing tabular Excel sheets into DataFrame objects.

This ExcelFile will let us work with sheets easily, and will be faster than the previous read_excel method.

In [84]:
excel_file = pd.ExcelFile('data/products.xlsx')

excel_file

In [85]:
excel_file.sheet_names

['Products', 'Descriptions', 'Merchants']

***Now as we can see Sheet names at one place without looking at Excel file, we can select one and work on it.***

In [86]:
products = excel_file.parse('Products')

products.head(2)

,product_id,price,merchant_id,brand,name
0,AVphzgbJLJeJML43fA0o,104.99,1001,Sanus,Sanus VLF410B1 10-Inch Super Slim Full-Motion ...
1,AVpgMuGwLJeJML43KY_c,69.00,1002,Boytone,Boytone - 2500W 2.1-Ch. Home Theater System - ...

***`parse()` method has all the parameters of `read_excel()` method.***

In [88]:
products = excel_file.parse(sheet_name='Products',
                            index_col='product_id')

products.head(2)

,price,merchant_id,brand,name
product_id,,,,
AVphzgbJLJeJML43fA0o,104.99,1001,Sanus,Sanus VLF410B1 10-Inch Super Slim Full-Motion ...
AVpgMuGwLJeJML43KY_c,69.00,1002,Boytone,Boytone - 2500W 2.1-Ch. Home Theater System - ...

#####

> ### Saving file using `to_excel`

In [ ]:
products.to_excel('final.xlsx')

- Note: You need `openpyxl` library to perform this operation. `pip install openpyxl`

#####

> ### Positioning Data with `startrow` and `startcol` 

- startrow and startcol leave blank rows and columns in our sheet while saving.

In [ ]:
products.to_excel('final.xlsx',
                  startrow=1,
                  startcol=2)

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)